{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "39f4cbe1",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "# Warning control\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "aa24a49a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load from environment\n",
    "load_dotenv(override=True)\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "bbc8242b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to the knowledge graph instance using LangChain\n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad13faab",
   "metadata": {},
   "source": [
    "### Create a vector index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c84a2d42",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"\"\"\n",
    "  CREATE VECTOR INDEX movie_tagline_embeddings IF NOT EXISTS\n",
    "  FOR (m:Movie) ON (m.taglineEmbedding) \n",
    "  OPTIONS { indexConfig: {\n",
    "    `vector.dimensions`: 384,\n",
    "    `vector.similarity_function`: 'cosine'\n",
    "  }}\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e9d68b55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 3,\n",
       "  'name': 'movie_tagline_embeddings',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'VECTOR',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Movie'],\n",
       "  'properties': ['taglineEmbedding'],\n",
       "  'indexProvider': 'vector-3.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\n",
    "\"\"\"\n",
    "SHOW VECTOR INDEXES\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aadcc2d0",
   "metadata": {},
   "source": [
    "### Populate the vector index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "3f9c0212",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_huggingface import HuggingFaceEndpointEmbeddings\n",
    "\n",
    "model_name = \"sentence-transformers/all-MiniLM-L6-v2\"\n",
    "\n",
    "hf_embeddings = HuggingFaceEndpointEmbeddings(\n",
    "    model=model_name,\n",
    "    task=\"feature-extraction\",\n",
    "    huggingfacehub_api_token=os.getenv(\"HUGGINGFACE_API_KEY\"),\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e3cf10a6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# easy with openai\n",
    "\n",
    "# kg.query(\"\"\"\n",
    "#     MATCH (movie:Movie) WHERE movie.tagline IS NOT NULL\n",
    "#     WITH movie, genai.vector.encode(\n",
    "#         movie.tagline, \n",
    "#         \"OpenAI\", \n",
    "#         {\n",
    "#           token: $openAiApiKey,\n",
    "#           endpoint: $openAiEndpoint\n",
    "#         }) AS vector\n",
    "#     CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", vector)\n",
    "#     \"\"\", \n",
    "#     params={\"openAiApiKey\":OPENAI_API_KEY, \"openAiEndpoint\": OPENAI_ENDPOINT} )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4510bbb8",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=4, column=38, offset=99>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 99, 'line': 4, 'column': 38}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n    MATCH (movie:Movie) \\n    WHERE movie.tagline IS NOT NULL\\n    RETURN movie.tagline AS tagline, ID(movie) AS id\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=3, column=15, offset=44>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 44, 'line': 3, 'column': 15}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (movie:Movie) \\n        WHERE ID(movie) = $movie_id\\n        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\\n        '\n"
     ]
    }
   ],
   "source": [
    "# i want to try with open source models (so HF embeddings)\n",
    "\n",
    "# Get all movies with taglines\n",
    "movies = kg.query(\"\"\"\n",
    "    MATCH (movie:Movie) \n",
    "    WHERE movie.tagline IS NOT NULL\n",
    "    RETURN movie.tagline AS tagline, ID(movie) AS id\n",
    "\"\"\")\n",
    "\n",
    "# Generate embeddings for all taglines\n",
    "taglines = [m['tagline'] for m in movies]\n",
    "embeddings = hf_embeddings.embed_documents(taglines)\n",
    "\n",
    "# Store embeddings back in Neo4j\n",
    "for movie, embedding in zip(movies, embeddings):\n",
    "    kg.query(\"\"\"\n",
    "        MATCH (movie:Movie) \n",
    "        WHERE ID(movie) = $movie_id\n",
    "        CALL db.create.setNodeVectorProperty(movie, \"taglineEmbedding\", $embedding)\n",
    "        \"\"\",\n",
    "        params={\"movie_id\": movie['id'], \"embedding\": embedding}\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a45ee0de",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "37"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(embeddings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c7a9fb16",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = kg.query(\"\"\"\n",
    "    MATCH (m:Movie) \n",
    "    WHERE m.tagline IS NOT NULL\n",
    "    RETURN m.tagline, m.taglineEmbedding\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "55403d90",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Welcome to the Real World'"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result[0]['m.tagline']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "0c10f2db",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[0.004916847217828035,\n",
       " -0.0370774008333683,\n",
       " -0.05302993580698967,\n",
       " 0.08803059160709381,\n",
       " 0.002610360039398074,\n",
       " -0.04897091165184975,\n",
       " 0.010284018702805042,\n",
       " -0.020684707909822464,\n",
       " 0.04854820668697357,\n",
       " 0.03980860859155655,\n",
       " 0.14016038179397583,\n",
       " 0.009561889804899693,\n",
       " -0.011948537081480026,\n",
       " 0.02574753202497959,\n",
       " -0.100343719124794,\n",
       " -0.06849749386310577,\n",
       " 0.06089349091053009,\n",
       " -0.09545785933732986,\n",
       " -0.12708042562007904,\n",
       " -0.008842960931360722,\n",
       " 0.0013119467766955495,\n",
       " -0.025083083659410477,\n",
       " -0.03771349415183067,\n",
       " 0.06817325204610825,\n",
       " -0.006272147875279188,\n",
       " 0.019774923101067543,\n",
       " -0.006198229733854532,\n",
       " 0.02108805812895298,\n",
       " -0.03142925351858139,\n",
       " -0.045716773718595505,\n",
       " -0.022434985265135765,\n",
       " 0.06367078423500061,\n",
       " 0.0712144747376442,\n",
       " -0.03672400861978531,\n",
       " -0.0282735712826252,\n",
       " -0.009561496786773205,\n",
       " 0.03462420031428337,\n",
       " 0.004063514061272144,\n",
       " 0.0007250744383782148,\n",
       " -0.03857341781258583,\n",
       " 0.02384009212255478,\n",
       " -0.07178183645009995,\n",
       " -0.01787034049630165,\n",
       " -0.005254504270851612,\n",
       " 0.006876529660075903,\n",
       " 0.05332787707448006,\n",
       " 0.03762448951601982,\n",
       " 0.022574808448553085,\n",
       " 0.13702218234539032,\n",
       " -0.020313937216997147,\n",
       " -0.07155391573905945,\n",
       " -0.005222905892878771,\n",
       " -0.024357955902814865,\n",
       " 0.02884972095489502,\n",
       " 0.04607817530632019,\n",
       " 0.04950537532567978,\n",
       " -0.002875340636819601,\n",
       " 0.001734397141262889,\n",
       " 0.05392589792609215,\n",
       " -0.0028581509832292795,\n",
       " 0.027758236974477768,\n",
       " -0.015303556807339191,\n",
       " 0.02852601371705532,\n",
       " 0.04641955345869064,\n",
       " 0.038585249334573746,\n",
       " -0.0034264554269611835,\n",
       " -0.01519941259175539,\n",
       " -0.008160816505551338,\n",
       " 0.028146810829639435,\n",
       " 0.006610415875911713,\n",
       " -0.10509058088064194,\n",
       " 0.12274342775344849,\n",
       " 0.02770916186273098,\n",
       " 0.018536895513534546,\n",
       " 0.06685144454240799,\n",
       " 0.0007371572428382933,\n",
       " -0.011351451277732849,\n",
       " 0.01070490200072527,\n",
       " 0.1077752560377121,\n",
       " 0.043514151126146317,\n",
       " 0.05254596844315529,\n",
       " -0.0841967910528183,\n",
       " -0.015304652974009514,\n",
       " 0.053286682814359665,\n",
       " 0.008032920770347118,\n",
       " 0.07132510840892792,\n",
       " 0.026304157450795174,\n",
       " -0.0659819021821022,\n",
       " 0.022842662408947945,\n",
       " 0.009470409713685513,\n",
       " -0.13576075434684753,\n",
       " 0.004472052678465843,\n",
       " -0.023649364709854126,\n",
       " -0.022125544026494026,\n",
       " -0.1494474560022354,\n",
       " -0.023808542639017105,\n",
       " 0.03621700406074524,\n",
       " -0.044790975749492645,\n",
       " -0.005587590858340263,\n",
       " 0.06884333491325378,\n",
       " 0.01074988767504692,\n",
       " -0.009160980582237244,\n",
       " 0.03784609213471413,\n",
       " 0.046847227960824966,\n",
       " 0.08044896274805069,\n",
       " 0.015500489622354507,\n",
       " 0.05123636871576309,\n",
       " -0.008076292462646961,\n",
       " -0.0480751134455204,\n",
       " -0.10706339031457901,\n",
       " -0.020968463271856308,\n",
       " -0.05469927191734314,\n",
       " 0.03686928376555443,\n",
       " -0.05445190146565437,\n",
       " 0.0036924462765455246,\n",
       " -0.02111584134399891,\n",
       " -0.08856868743896484,\n",
       " 0.0005067134625278413,\n",
       " -0.0027533534448593855,\n",
       " -0.06720350682735443,\n",
       " 0.019438954070210457,\n",
       " -0.008447712287306786,\n",
       " -0.017915742471814156,\n",
       " 0.027644990012049675,\n",
       " 0.0009933538967743516,\n",
       " -0.08318793773651123,\n",
       " -0.013521279208362103,\n",
       " -4.704062803735906e-33,\n",
       " -0.0355476476252079,\n",
       " 0.01778399385511875,\n",
       " 0.09063761681318283,\n",
       " 0.03507952392101288,\n",
       " -0.027184288948774338,\n",
       " -0.014028887264430523,\n",
       " -0.09781692922115326,\n",
       " -0.010183109901845455,\n",
       " 0.036826279014348984,\n",
       " -0.007549958769232035,\n",
       " 0.09958402067422867,\n",
       " 0.10623519122600555,\n",
       " -0.0005645400960929692,\n",
       " -0.024028826504945755,\n",
       " -0.003614319022744894,\n",
       " 0.01157700177282095,\n",
       " -0.08077739179134369,\n",
       " 0.062431082129478455,\n",
       " 0.03247976675629616,\n",
       " 0.08355173468589783,\n",
       " -0.06308126449584961,\n",
       " -0.01074897963553667,\n",
       " -0.00794330146163702,\n",
       " 0.08011876046657562,\n",
       " -0.03292037919163704,\n",
       " 0.018199214711785316,\n",
       " -0.018178284168243408,\n",
       " -0.027767322957515717,\n",
       " 0.07440606504678726,\n",
       " -0.0017820252105593681,\n",
       " -0.01720992848277092,\n",
       " -0.004808600526303053,\n",
       " -0.0015005763852968812,\n",
       " -0.06215471401810646,\n",
       " -0.04723738506436348,\n",
       " 0.007053554058074951,\n",
       " 0.004017023369669914,\n",
       " -0.033465925604104996,\n",
       " -0.04112342745065689,\n",
       " -0.025724120438098907,\n",
       " -0.035078264772892,\n",
       " 0.004886064678430557,\n",
       " -0.038847293704748154,\n",
       " 0.03341924771666527,\n",
       " -0.057100482285022736,\n",
       " 0.06193630024790764,\n",
       " 0.07863906770944595,\n",
       " 0.050272952765226364,\n",
       " -0.02753499522805214,\n",
       " 0.039091575890779495,\n",
       " -0.058476172387599945,\n",
       " 0.07720346003770828,\n",
       " 0.07098573446273804,\n",
       " 0.014774763956665993,\n",
       " -0.021263904869556427,\n",
       " 0.007567622233182192,\n",
       " -0.016996541991829872,\n",
       " 0.05120661482214928,\n",
       " -0.05379873141646385,\n",
       " 0.08540654927492142,\n",
       " -0.031785767525434494,\n",
       " 0.03201476112008095,\n",
       " 0.060029905289411545,\n",
       " 0.057302169501781464,\n",
       " -0.07469218969345093,\n",
       " 0.0027633029967546463,\n",
       " 0.02249992825090885,\n",
       " 0.004010352306067944,\n",
       " 0.0027497615665197372,\n",
       " 0.01085046399384737,\n",
       " -0.02472398430109024,\n",
       " -0.011491508223116398,\n",
       " -0.008541193790733814,\n",
       " 0.01880955882370472,\n",
       " 0.048735447227954865,\n",
       " 0.018500862643122673,\n",
       " 0.0501696951687336,\n",
       " -0.06476341933012009,\n",
       " 0.02094877138733864,\n",
       " 0.04519234597682953,\n",
       " 0.02461876906454563,\n",
       " 0.02058498188853264,\n",
       " 0.06819049268960953,\n",
       " -0.03841399401426315,\n",
       " 0.10498686879873276,\n",
       " -0.06383975595235825,\n",
       " 0.0047918884083628654,\n",
       " -0.07140815258026123,\n",
       " 0.012806582264602184,\n",
       " 0.02003951370716095,\n",
       " -0.07642766088247299,\n",
       " 0.0018978327279910445,\n",
       " 0.005218580365180969,\n",
       " -0.010445716790854931,\n",
       " -0.056794002652168274,\n",
       " 2.3003550171668742e-33,\n",
       " 0.00928832683712244,\n",
       " 0.03957013040781021,\n",
       " -0.03549220785498619,\n",
       " 0.02980857715010643,\n",
       " 0.0054146647453308105,\n",
       " -0.053826745599508286,\n",
       " -0.025289267301559448,\n",
       " 0.08294491469860077,\n",
       " 0.0028561872895807028,\n",
       " 0.12087791413068771,\n",
       " 0.09187304228544235,\n",
       " 0.020391512662172318,\n",
       " 0.007861115038394928,\n",
       " 0.05519420653581619,\n",
       " 0.09805373847484589,\n",
       " -0.04168780520558357,\n",
       " 0.1016993373632431,\n",
       " -0.056429896503686905,\n",
       " -0.1069425493478775,\n",
       " -0.006932616233825684,\n",
       " 0.08378572016954422,\n",
       " 0.005887914914637804,\n",
       " -0.06120135262608528,\n",
       " -0.030303705483675003,\n",
       " -0.08717247098684311,\n",
       " 0.01976550742983818,\n",
       " 0.030037783086299896,\n",
       " 0.0022601771634072065,\n",
       " -0.07850678265094757,\n",
       " -0.027181630954146385,\n",
       " 0.04372671619057655,\n",
       " 0.013243871740996838,\n",
       " -0.09738028049468994,\n",
       " 0.009741163812577724,\n",
       " -0.03404751047492027,\n",
       " -0.03396926820278168,\n",
       " 0.006522356066852808,\n",
       " 0.041389092803001404,\n",
       " 0.02827397733926773,\n",
       " 0.00549987331032753,\n",
       " 0.05015205591917038,\n",
       " -0.029467198997735977,\n",
       " -0.10044877231121063,\n",
       " -0.01950719766318798,\n",
       " -0.059827081859111786,\n",
       " 0.031865671277046204,\n",
       " 0.012405206449329853,\n",
       " -0.008394092321395874,\n",
       " -0.04576936364173889,\n",
       " -0.042260508984327316,\n",
       " -0.06151820346713066,\n",
       " 0.07470624893903732,\n",
       " 0.028908882290124893,\n",
       " -0.1141529306769371,\n",
       " -0.01438179612159729,\n",
       " 0.00843809824436903,\n",
       " -0.05098593607544899,\n",
       " 0.08171384781599045,\n",
       " 0.1105051264166832,\n",
       " 0.03912164270877838,\n",
       " -0.06201369687914848,\n",
       " -0.040317077189683914,\n",
       " -0.06999191641807556,\n",
       " 0.013061411678791046,\n",
       " 0.06283264607191086,\n",
       " -0.06283175945281982,\n",
       " -0.019473185762763023,\n",
       " 0.07111930102109909,\n",
       " -0.07239022850990295,\n",
       " -0.035237040370702744,\n",
       " -0.04130278900265694,\n",
       " 0.042288824915885925,\n",
       " -0.04705957695841789,\n",
       " -0.04105036333203316,\n",
       " -0.08813291043043137,\n",
       " -0.012733476236462593,\n",
       " -0.04718165099620819,\n",
       " 0.02168659307062626,\n",
       " 0.03305618837475777,\n",
       " -0.05733853951096535,\n",
       " 0.04775185137987137,\n",
       " -0.024189738556742668,\n",
       " 0.055933061987161636,\n",
       " 0.08421919494867325,\n",
       " 0.0685141384601593,\n",
       " 0.015029111877083778,\n",
       " 0.019332528114318848,\n",
       " -0.04484759643673897,\n",
       " -0.004872589837759733,\n",
       " 0.008935362100601196,\n",
       " -0.09672500193119049,\n",
       " -0.01394724566489458,\n",
       " -0.045270830392837524,\n",
       " 0.06745757162570953,\n",
       " -0.11474908143281937,\n",
       " -1.720563069795844e-08,\n",
       " -0.09385285526514053,\n",
       " -0.032975934445858,\n",
       " -0.006818182300776243,\n",
       " 0.03166696056723595,\n",
       " 0.05292025953531265,\n",
       " 0.058859534561634064,\n",
       " -0.05176185071468353,\n",
       " 0.0018224007217213511,\n",
       " -0.07820933312177658,\n",
       " 0.09317568689584732,\n",
       " 0.013757151551544666,\n",
       " -0.039758916944265366,\n",
       " 0.055872347205877304,\n",
       " 0.1017797589302063,\n",
       " 0.042666494846343994,\n",
       " 0.007725703064352274,\n",
       " 0.014134281314909458,\n",
       " -0.05990811437368393,\n",
       " -0.037263546139001846,\n",
       " 0.053691450506448746,\n",
       " 0.017674347385764122,\n",
       " 0.0773220807313919,\n",
       " 0.02541317604482174,\n",
       " 0.00907776691019535,\n",
       " -0.019727950915694237,\n",
       " -0.01413554698228836,\n",
       " 0.04800417646765709,\n",
       " -0.018523680046200752,\n",
       " -0.041562676429748535,\n",
       " 0.020399797707796097,\n",
       " 0.04852334409952164,\n",
       " 0.06164262443780899,\n",
       " 0.002260620007291436,\n",
       " 0.000239557572058402,\n",
       " -0.04786181449890137,\n",
       " 0.0551120787858963,\n",
       " 0.03593698889017105,\n",
       " 0.02173609659075737,\n",
       " 0.03341793268918991,\n",
       " -0.06836070865392685,\n",
       " -0.10709688812494278,\n",
       " 0.0430726632475853,\n",
       " 0.0054809027351439,\n",
       " 0.0034003485925495625,\n",
       " -0.1560785323381424,\n",
       " 0.02446718141436577,\n",
       " 0.02612468972802162,\n",
       " 0.004192173480987549,\n",
       " 0.026702027767896652,\n",
       " -0.030425462871789932,\n",
       " 0.01295863650739193,\n",
       " 0.02100486308336258,\n",
       " 0.10068857669830322,\n",
       " 0.043682318180799484,\n",
       " 0.09476710110902786,\n",
       " -0.009489827789366245,\n",
       " 0.007132833357900381,\n",
       " 0.003927098587155342,\n",
       " -0.03631770238280296,\n",
       " 0.04907258599996567,\n",
       " -0.008812091313302517,\n",
       " -0.02352222055196762,\n",
       " 0.06343123316764832,\n",
       " 0.04673507437109947]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result[0]['m.taglineEmbedding']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "02a0f731",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "384"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(result[0]['m.taglineEmbedding'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5680706a",
   "metadata": {},
   "source": [
    "### Semantic Similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "96f4419f",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"What movies are about love?\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17694a29",
   "metadata": {},
   "outputs": [],
   "source": [
    "# for openai\n",
    "\n",
    "# kg.query(\"\"\"\n",
    "#     WITH genai.vector.encode(\n",
    "#         $question, \n",
    "#         \"OpenAI\", \n",
    "#         {\n",
    "#           token: $openAiApiKey,\n",
    "#           endpoint: $openAiEndpoint\n",
    "#         }) AS question_embedding\n",
    "#     CALL db.index.vector.queryNodes(\n",
    "#         'movie_tagline_embeddings', \n",
    "#         $top_k, \n",
    "#         question_embedding\n",
    "#         ) YIELD node AS movie, score\n",
    "#     RETURN movie.title, movie.tagline, score\n",
    "#     \"\"\", \n",
    "#     params={\"openAiApiKey\":OPENAI_API_KEY,\n",
    "#             \"openAiEndpoint\": OPENAI_ENDPOINT,\n",
    "#             \"question\": question,\n",
    "#             \"top_k\": 5\n",
    "#             })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "80f767cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "question_embedding = hf_embeddings.embed_query(question)\n",
    "\n",
    "# Use the embedding in Neo4j vector search\n",
    "results = kg.query(\"\"\"\n",
    "    CALL db.index.vector.queryNodes(\n",
    "        'movie_tagline_embeddings', \n",
    "        $top_k, \n",
    "        $question_embedding\n",
    "    ) YIELD node AS movie, score\n",
    "    RETURN movie.title, movie.tagline, score\n",
    "    \"\"\", \n",
    "    params={\n",
    "        \"question_embedding\": question_embedding,\n",
    "        \"top_k\": 5\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "4acdc5aa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie.title': 'As Good as It Gets',\n",
       "  'movie.tagline': 'A comedy from the heart that goes for the throat.',\n",
       "  'score': 0.7580915689468384},\n",
       " {'movie.title': 'Joe Versus the Volcano',\n",
       "  'movie.tagline': 'A story of love, lava and burning desire.',\n",
       "  'score': 0.7532861232757568},\n",
       " {'movie.title': 'Snow Falling on Cedars',\n",
       "  'movie.tagline': 'First loves last. Forever.',\n",
       "  'score': 0.7330302000045776},\n",
       " {'movie.title': 'When Harry Met Sally',\n",
       "  'movie.tagline': 'Can two friends sleep together and still love each other in the morning?',\n",
       "  'score': 0.6664345264434814},\n",
       " {'movie.title': \"You've Got Mail\",\n",
       "  'movie.tagline': 'At odds in life... in love on-line.',\n",
       "  'score': 0.6634907722473145}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fccd3325",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "agents_experimental",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
